Tekla.Structures.Model.CylindricalSurfaceNode
The CylindricalSurfaceNode class represents cylindrical surface geometry tree node.

Tekla.Structures.Model.CylindricalSurfaceNode.#ctor(Tekla.Structures.Model.CylindricalSurface)
Initializes a new instance of the CylindricalSurfaceNode class.
surface: The contour of the node.

Tekla.Structures.Model.CylindricalSurfaceNode.Surface
Gets the cylindrical surface geometry.

Tekla.Structures.Model.CylindricalSurfaceNode.AcceptVisitor(Tekla.Structures.Model.IGeometryNodeVisitor)
Entry method for the visitor pattern
visitor:

Tekla.Structures.Model.CylindricalSurfaceNode.Clone
Creates a new object that is a copy of the current instance.
Returns: A new object that is a copy of the current instance.